package validation

import (
	"regexp"
	"unicode/utf8"

	"github.com/go-playground/validator/v10"
)

var (
	// حروف الفبای فارسی: (پ، چ، ژ، گ، ک، ی و...)
	// حروف عربی رایج در کیبوردهای مختلف: (ك، ي، ة، أ، إ، ؤ، ء و...)
	// اعداد: اعداد فارسی (۰-۹) و اعداد عربی (٠-٩)
	// فاصله‌ها: فاصله معمولی (Space) و نیم‌فاصله (\u200C - ZWNJ)
	// علائم نگارشی فارسی/عربی: (، ؛ ؟ % و...)
	// رسما میشه فقط متن فارسی
	// `^[ \t\x{0621}-\x{0628}\x{062A}-\x{063A}\x{0641}-\x{0642}\x{0644}-\x{0648}\x{064E}-\x{0651}\x{0655}\x{067E}\x{0686}\x{0698}\x{06A9}\x{06AF}\x{06BE}\x{06CC}\x{0629}\x{0643}\x{0649}-\x{064B}\x{064D}\x{06D5}\x{06F0}-\x{06F9}\x{0660}-\x{0669}\x{200C}\x{200D}\x{060C}\x{061B}\x{061F}\x{0640}\x{066A}\x{066B}\x{066C}]{2,}$`
	// اما من گذاشتم حداقل ی کلمه ای که دو حرفه حداقل باشه و کل متن باید زیر 95 کاراتر باشه
	roleTitleRegex = regexp.MustCompile(
		`^[ \t\x{0621}-\x{0628}\x{062A}-\x{063A}\x{0641}-\x{0642}\x{0644}-\x{0648}\x{064E}-\x{0651}\x{0655}\x{067E}\x{0686}\x{0698}\x{06A9}\x{06AF}\x{06BE}\x{06CC}\x{0629}\x{0643}\x{0649}-\x{064B}\x{064D}\x{06D5}\x{06F0}-\x{06F9}\x{0660}-\x{0669}\x{200C}\x{200D}\x{060C}\x{061B}\x{061F}\x{0640}\x{066A}\x{066B}\x{066C}]*` +
			`[\x{0621}-\x{0628}\x{062A}-\x{063A}\x{0641}-\x{0642}\x{0644}-\x{0648}\x{064E}-\x{0651}\x{0655}\x{067E}\x{0686}\x{0698}\x{06A9}\x{06AF}\x{06BE}\x{06CC}\x{0629}\x{0643}\x{0649}-\x{064B}\x{064D}\x{06D5}]{2,}` +
			`[ \t\x{0621}-\x{0628}\x{062A}-\x{063A}\x{0641}-\x{0642}\x{0644}-\x{0648}\x{064E}-\x{0651}\x{0655}\x{067E}\x{0686}\x{0698}\x{06A9}\x{06AF}\x{06BE}\x{06CC}\x{0629}\x{0643}\x{0649}-\x{064B}\x{064D}\x{06D5}\x{06F0}-\x{06F9}\x{0660}-\x{0669}\x{200C}\x{200D}\x{060C}\x{061B}\x{061F}\x{0640}\x{066A}\x{066B}\x{066C}]*$`)
)

func ValidateRoleTitle(fl validator.FieldLevel) bool {
	title := fl.Field().String()
	length := utf8.RuneCountInString(title)
	if length < 2 || length > 95 {
		return false
	}

	return roleTitleRegex.MatchString(title)
}
